# CannotToSplitWallPanels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..CannotToSplitWallPanels Property
BuiltInFailures..::..WallFailures Class See Also
---
Unable to split wall panel(s).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotToSplitWallPanels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotToSplitWallPanels As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotToSplitWallPanels {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace